
# State **`s3://infrahouse-aws-control-990466748045/terraform.tfstate`**
## Affected resources counts

|  Success  |   🟢 Add |   🟡 Change |    Destroy |
|:---------:|--------:|-----------:|-----------:|
|     ✅     |       7 |          1 |          0 |
## Affected resources by action

|  Action  | Resources                                                                           |
|:--------:|:------------------------------------------------------------------------------------|
|    🟢     | `module.ih-tf-aws-control-990466748045-admin.aws_iam_policy.github`                 |
|    🟢     | `module.ih-tf-aws-control-990466748045-admin.aws_iam_role_policy_attachment.github` |
|    🟢     | `module.mediapc.aws_iam_access_key.backuper`                                        |
|    🟢     | `module.mediapc.aws_iam_policy.backuper`                                            |
|    🟢     | `module.mediapc.aws_iam_user.backuper`                                              |
|    🟢     | `module.mediapc.aws_iam_user_policy_attachment.backuper`                            |
|    🟢     | `module.mediapc.aws_s3_bucket.dst`                                                  |
|    🟢     | `data.aws_iam_policy_document.ih-tf-terraform-control-assume:`                      |
|    🟡     | `module.ih-tf-aws-control-990466748045-admin.aws_iam_role.admin`                    |
<details>
<summary>STDOUT</summary>

```[command]/home/runner/work/_temp/9b93b3e5-92ae-4969-8551-f4502fc9011a/terraform-bin plan -no-color -var-file=configuration.tfvars --out=tf.plan
data.aws_iam_policy_document.ih-tf-terraform-control-assume: Reading...
data.aws_iam_policy_document.ih-tf-terraform-control-assume: Read complete after 0s [id=1268673852]
data.aws_iam_policy_document.allow-assume: Reading...
module.ih-tf-aws-control-990466748045-admin.data.aws_iam_policy_document.github-permissions: Reading...
data.aws_iam_policy.administrator-access: Reading...
module.ih-tf-aws-control-990466748045-admin.data.aws_iam_policy.admin: Reading...
module.github-connector.aws_iam_openid_connect_provider.github: Refreshing state... [id=arn:aws:iam::990466748045:oidc-provider/token.actions.githubusercontent.com]
aws_iam_user.aleks: Refreshing state... [id=aleks]
aws_iam_role.ih-tf-terraform-control: Refreshing state... [id=ih-tf-terraform-control]
data.aws_iam_policy_document.allow-assume: Read complete after 0s [id=2219106455]
module.ih-tf-aws-control-990466748045-admin.data.aws_iam_policy_document.github-permissions: Read complete after 0s [id=2054866892]
aws_iam_policy.allow-assume: Refreshing state... [id=arn:aws:iam::990466748045:policy/allow-assume]
module.ih-tf-aws-control-990466748045-admin.data.aws_iam_policy_document.github-assume: Reading...
module.ih-tf-aws-control-990466748045-admin.data.aws_iam_policy_document.github-assume: Read complete after 0s [id=1250416815]
module.ih-tf-aws-control-990466748045-admin.aws_iam_role.github: Refreshing state... [id=ih-tf-aws-control-github]
aws_iam_access_key.aleks: Refreshing state... [id=AKIA6NHDLF2G665VS5V2]
data.aws_iam_policy_document.aws-admin: Reading...
data.aws_iam_policy_document.aws-admin: Read complete after 0s [id=2092112735]
aws_iam_role.aws-admin: Refreshing state... [id=aws-admin]
aws_iam_user_policy_attachment.aleks: Refreshing state... [id=aleks-20230630022352782000000001]
module.ih-tf-aws-control-990466748045-admin.data.aws_iam_policy_document.admin-assume: Reading...
module.ih-tf-aws-control-990466748045-admin.data.aws_iam_policy_document.admin-assume: Read complete after 0s [id=4181394228]
module.ih-tf-aws-control-990466748045-admin.aws_iam_role.admin: Refreshing state... [id=ih-tf-aws-control-admin]
data.aws_iam_policy.administrator-access: Read complete after 2s [id=arn:aws:iam::aws:policy/AdministratorAccess]
aws_iam_role_policy_attachment.ih-tf-terraform-control: Refreshing state... [id=ih-tf-terraform-control-20230630023317121000000001]
aws_iam_role_policy_attachment.aws-admin: Refreshing state... [id=aws-admin-20230322021121795000000001]
module.ih-tf-aws-control-990466748045-admin.data.aws_iam_policy.admin: Read complete after 2s [id=arn:aws:iam::aws:policy/AdministratorAccess]
module.ih-tf-aws-control-990466748045-admin.aws_iam_role_policy_attachment.admin: Refreshing state... [id=ih-tf-aws-control-admin-20230703024608473400000001]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.ih-tf-aws-control-990466748045-admin.aws_iam_policy.github will be created
  + resource "aws_iam_policy" "github" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = "ih-tf-aws-control-github"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "sts:AssumeRole"
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = "s3:*"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:s3:::infrahouse-aws-control-990466748045/*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = {
          + "created_by" = "infrahouse/aws-control-990466748045"
        }
    }

  # module.ih-tf-aws-control-990466748045-admin.aws_iam_role.admin will be updated in-place
  ~ resource "aws_iam_role" "admin" {
      ~ assume_role_policy    = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Principal = {
                          ~ AWS = [
                              - "arn:aws:iam::990466748045:user/aleks",
                              - "arn:aws:iam::990466748045:role/ih-tf-aws-control-github",
                            ] -> "arn:aws:iam::990466748045:role/ih-tf-aws-control-github"
                        }
                        # (3 unchanged attributes hidden)
                    },
                  - {
                      - Action    = "sts:AssumeRoleWithWebIdentity"
                      - Condition = {
                          - StringEquals = {
                              - "token.actions.githubusercontent.com:aud" = "sts.amazonaws.com"
                            }
                          - StringLike   = {
                              - "token.actions.githubusercontent.com:sub" = "repo:infrahouse/aws-control:*"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Federated = "arn:aws:iam::990466748045:oidc-provider/token.actions.githubusercontent.com"
                        }
                      - Sid       = "010"
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        id                    = "ih-tf-aws-control-admin"
        name                  = "ih-tf-aws-control-admin"
        tags                  = {}
        # (9 unchanged attributes hidden)
    }

  # module.ih-tf-aws-control-990466748045-admin.aws_iam_role_policy_attachment.github will be created
  + resource "aws_iam_role_policy_attachment" "github" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "ih-tf-aws-control-github"
    }

  # module.mediapc.data.aws_iam_policy_document.backuper-permissions will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "backuper-permissions" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "s3:*",
            ]
          + resources = [
              + (known after apply),
            ]
        }
    }

  # module.mediapc.aws_iam_access_key.backuper will be created
  + resource "aws_iam_access_key" "backuper" {
      + create_date                    = (known after apply)
      + encrypted_secret               = (known after apply)
      + encrypted_ses_smtp_password_v4 = (known after apply)
      + id                             = (known after apply)
      + key_fingerprint                = (known after apply)
      + secret                         = (sensitive value)
      + ses_smtp_password_v4           = (sensitive value)
      + status                         = "Active"
      + user                           = (known after apply)
    }

  # module.mediapc.aws_iam_policy.backuper will be created
  + resource "aws_iam_policy" "backuper" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = (known after apply)
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # module.mediapc.aws_iam_user.backuper will be created
  + resource "aws_iam_user" "backuper" {
      + arn           = (known after apply)
      + force_destroy = false
      + id            = (known after apply)
      + name          = (known after apply)
      + path          = "/"
      + tags_all      = (known after apply)
      + unique_id     = (known after apply)
    }

  # module.mediapc.aws_iam_user_policy_attachment.backuper will be created
  + resource "aws_iam_user_policy_attachment" "backuper" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + user       = (known after apply)
    }

  # module.mediapc.aws_s3_bucket.dst will be created
  + resource "aws_s3_bucket" "dst" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = (known after apply)
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = "twindb"
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

Plan: 7 to add, 1 to change, 0 to destroy.

Changes to Outputs:
  + mediapc-access-key = (sensitive value)
  + mediapc-bucket     = (known after apply)
  + mediapc-region     = (known after apply)
  + mediapc-secret-key = (sensitive value)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan"
::debug::Terraform exited with code 0.
::debug::stdout: data.aws_iam_policy_document.ih-tf-terraform-control-assume: Reading...%0Adata.aws_iam_policy_document.ih-tf-terraform-control-assume: Read complete after 0s [id=1268673852]%0Adata.aws_iam_policy_document.allow-assume: Reading...%0Amodule.ih-tf-aws-control-990466748045-admin.data.aws_iam_policy_document.github-permissions: Reading...%0Adata.aws_iam_policy.administrator-access: Reading...%0Amodule.ih-tf-aws-control-990466748045-admin.data.aws_iam_policy.admin: Reading...%0Amodule.github-connector.aws_iam_openid_connect_provider.github: Refreshing state... [id=arn:aws:iam::990466748045:oidc-provider/token.actions.githubusercontent.com]%0Aaws_iam_user.aleks: Refreshing state... [id=aleks]%0Aaws_iam_role.ih-tf-terraform-control: Refreshing state... [id=ih-tf-terraform-control]%0Adata.aws_iam_policy_document.allow-assume: Read complete after 0s [id=2219106455]%0Amodule.ih-tf-aws-control-990466748045-admin.data.aws_iam_policy_document.github-permissions: Read complete after 0s [id=2054866892]%0Aaws_iam_policy.allow-assume: Refreshing state... [id=arn:aws:iam::990466748045:policy/allow-assume]%0Amodule.ih-tf-aws-control-990466748045-admin.data.aws_iam_policy_document.github-assume: Reading...%0Amodule.ih-tf-aws-control-990466748045-admin.data.aws_iam_policy_document.github-assume: Read complete after 0s [id=1250416815]%0Amodule.ih-tf-aws-control-990466748045-admin.aws_iam_role.github: Refreshing state... [id=ih-tf-aws-control-github]%0Aaws_iam_access_key.aleks: Refreshing state... [id=AKIA6NHDLF2G665VS5V2]%0Adata.aws_iam_policy_document.aws-admin: Reading...%0Adata.aws_iam_policy_document.aws-admin: Read complete after 0s [id=2092112735]%0Aaws_iam_role.aws-admin: Refreshing state... [id=aws-admin]%0Aaws_iam_user_policy_attachment.aleks: Refreshing state... [id=aleks-20230630022352782000000001]%0Amodule.ih-tf-aws-control-990466748045-admin.data.aws_iam_policy_document.admin-assume: Reading...%0Amodule.ih-tf-aws-control-990466748045-admin.data.aws_iam_policy_document.admin-assume: Read complete after 0s [id=4181394228]%0Amodule.ih-tf-aws-control-990466748045-admin.aws_iam_role.admin: Refreshing state... [id=ih-tf-aws-control-admin]%0Adata.aws_iam_policy.administrator-access: Read complete after 2s [id=arn:aws:iam::aws:policy/AdministratorAccess]%0Aaws_iam_role_policy_attachment.ih-tf-terraform-control: Refreshing state... [id=ih-tf-terraform-control-20230630023317121000000001]%0Aaws_iam_role_policy_attachment.aws-admin: Refreshing state... [id=aws-admin-20230322021121795000000001]%0Amodule.ih-tf-aws-control-990466748045-admin.data.aws_iam_policy.admin: Read complete after 2s [id=arn:aws:iam::aws:policy/AdministratorAccess]%0Amodule.ih-tf-aws-control-990466748045-admin.aws_iam_role_policy_attachment.admin: Refreshing state... [id=ih-tf-aws-control-admin-20230703024608473400000001]%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A  ~ update in-place%0A <= read (data resources)%0A%0ATerraform will perform the following actions:%0A%0A  # module.ih-tf-aws-control-990466748045-admin.aws_iam_policy.github will be created%0A  + resource "aws_iam_policy" "github" {%0A      + arn         = (known after apply)%0A      + id          = (known after apply)%0A      + name        = "ih-tf-aws-control-github"%0A      + name_prefix = (known after apply)%0A      + path        = "/"%0A      + policy      = jsonencode(%0A            {%0A              + Statement = [%0A                  + {%0A                      + Action   = "sts:AssumeRole"%0A                      + Effect   = "Allow"%0A                      + Resource = "*"%0A                    },%0A                  + {%0A                      + Action   = "s3:*"%0A                      + Effect   = "Allow"%0A                      + Resource = "arn:aws:s3:::infrahouse-aws-control-990466748045/*"%0A                    },%0A                ]%0A              + Version   = "2012-10-17"%0A            }%0A        )%0A      + policy_id   = (known after apply)%0A      + tags_all    = {%0A          + "created_by" = "infrahouse/aws-control-990466748045"%0A        }%0A    }%0A%0A  # module.ih-tf-aws-control-990466748045-admin.aws_iam_role.admin will be updated in-place%0A  ~ resource "aws_iam_role" "admin" {%0A      ~ assume_role_policy    = jsonencode(%0A          ~ {%0A              ~ Statement = [%0A                  ~ {%0A                      ~ Principal = {%0A                          ~ AWS = [%0A                              - "arn:aws:iam::990466748045:user/aleks",%0A                              - "arn:aws:iam::990466748045:role/ih-tf-aws-control-github",%0A                            ] -> "arn:aws:iam::990466748045:role/ih-tf-aws-control-github"%0A                        }%0A                        # (3 unchanged attributes hidden)%0A                    },%0A                  - {%0A                      - Action    = "sts:AssumeRoleWithWebIdentity"%0A                      - Condition = {%0A                          - StringEquals = {%0A                              - "token.actions.githubusercontent.com:aud" = "sts.amazonaws.com"%0A                            }%0A                          - StringLike   = {%0A                              - "token.actions.githubusercontent.com:sub" = "repo:infrahouse/aws-control:*"%0A                            }%0A                        }%0A                      - Effect    = "Allow"%0A                      - Principal = {%0A                          - Federated = "arn:aws:iam::990466748045:oidc-provider/token.actions.githubusercontent.com"%0A                        }%0A                      - Sid       = "010"%0A                    },%0A                ]%0A                # (1 unchanged attribute hidden)%0A            }%0A        )%0A        id                    = "ih-tf-aws-control-admin"%0A        name                  = "ih-tf-aws-control-admin"%0A        tags                  = {}%0A        # (9 unchanged attributes hidden)%0A    }%0A%0A  # module.ih-tf-aws-control-990466748045-admin.aws_iam_role_policy_attachment.github will be created%0A  + resource "aws_iam_role_policy_attachment" "github" {%0A      + id         = (known after apply)%0A      + policy_arn = (known after apply)%0A      + role       = "ih-tf-aws-control-github"%0A    }%0A%0A  # module.mediapc.data.aws_iam_policy_document.backuper-permissions will be read during apply%0A  # (config refers to values not yet known)%0A <= data "aws_iam_policy_document" "backuper-permissions" {%0A      + id   = (known after apply)%0A      + json = (known after apply)%0A%0A      + statement {%0A          + actions   = [%0A              + "s3:*",%0A            ]%0A          + resources = [%0A              + (known after apply),%0A            ]%0A        }%0A    }%0A%0A  # module.mediapc.aws_iam_access_key.backuper will be created%0A  + resource "aws_iam_access_key" "backuper" {%0A      + create_date                    = (known after apply)%0A      + encrypted_secret               = (known after apply)%0A      + encrypted_ses_smtp_password_v4 = (known after apply)%0A      + id                             = (known after apply)%0A      + key_fingerprint                = (known after apply)%0A      + secret                         = (sensitive value)%0A      + ses_smtp_password_v4           = (sensitive value)%0A      + status                         = "Active"%0A      + user                           = (known after apply)%0A    }%0A%0A  # module.mediapc.aws_iam_policy.backuper will be created%0A  + resource "aws_iam_policy" "backuper" {%0A      + arn         = (known after apply)%0A      + id          = (known after apply)%0A      + name        = (known after apply)%0A      + name_prefix = (known after apply)%0A      + path        = "/"%0A      + policy      = (known after apply)%0A      + policy_id   = (known after apply)%0A      + tags_all    = (known after apply)%0A    }%0A%0A  # module.mediapc.aws_iam_user.backuper will be created%0A  + resource "aws_iam_user" "backuper" {%0A      + arn           = (known after apply)%0A      + force_destroy = false%0A      + id            = (known after apply)%0A      + name          = (known after apply)%0A      + path          = "/"%0A      + tags_all      = (known after apply)%0A      + unique_id     = (known after apply)%0A    }%0A%0A  # module.mediapc.aws_iam_user_policy_attachment.backuper will be created%0A  + resource "aws_iam_user_policy_attachment" "backuper" {%0A      + id         = (known after apply)%0A      + policy_arn = (known after apply)%0A      + user       = (known after apply)%0A    }%0A%0A  # module.mediapc.aws_s3_bucket.dst will be created%0A  + resource "aws_s3_bucket" "dst" {%0A      + acceleration_status         = (known after apply)%0A      + acl                         = (known after apply)%0A      + arn                         = (known after apply)%0A      + bucket                      = (known after apply)%0A      + bucket_domain_name          = (known after apply)%0A      + bucket_prefix               = "twindb"%0A      + bucket_regional_domain_name = (known after apply)%0A      + force_destroy               = false%0A      + hosted_zone_id              = (known after apply)%0A      + id                          = (known after apply)%0A      + object_lock_enabled         = (known after apply)%0A      + policy                      = (known after apply)%0A      + region                      = (known after apply)%0A      + request_payer               = (known after apply)%0A      + tags_all                    = (known after apply)%0A      + website_domain              = (known after apply)%0A      + website_endpoint            = (known after apply)%0A    }%0A%0APlan: 7 to add, 1 to change, 0 to destroy.%0A%0AChanges to Outputs:%0A  + mediapc-access-key = (sensitive value)%0A  + mediapc-bucket     = (known after apply)%0A  + mediapc-region     = (known after apply)%0A  + mediapc-secret-key = (sensitive value)%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ASaved the plan to: tf.plan%0A%0ATo perform exactly these actions, run the following command to apply:%0A    terraform apply "tf.plan"%0A
::debug::stderr: 
::debug::exitcode: 0
```
</details>
<details>
<summary>STDERR</summary>

```no output```
</details>
<details><summary><i>metadata</i></summary>
<p>
```eyJzMzovL2luZnJhaG91c2UtYXdzLWNvbnRyb2wtOTkwNDY2NzQ4MDQ1L3RlcnJhZm9ybS50ZnN0YXRlIjogeyJzdWNjZXNzIjogdHJ1ZSwgInN0ZG91dCI6ICJbY29tbWFuZF0vaG9tZS9ydW5uZXIvd29yay9fdGVtcC85YjkzYjNlNS05MmFlLTQ5NjktODU1MS1mNDUwMmZjOTAxMWEvdGVycmFmb3JtLWJpbiBwbGFuIC1uby1jb2xvciAtdmFyLWZpbGU9Y29uZmlndXJhdGlvbi50ZnZhcnMgLS1vdXQ9dGYucGxhblxuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5paC10Zi10ZXJyYWZvcm0tY29udHJvbC1hc3N1bWU6IFJlYWRpbmcuLi5cbmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuaWgtdGYtdGVycmFmb3JtLWNvbnRyb2wtYXNzdW1lOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0xMjY4NjczODUyXVxuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5hbGxvdy1hc3N1bWU6IFJlYWRpbmcuLi5cbm1vZHVsZS5paC10Zi1hd3MtY29udHJvbC05OTA0NjY3NDgwNDUtYWRtaW4uZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5naXRodWItcGVybWlzc2lvbnM6IFJlYWRpbmcuLi5cbmRhdGEuYXdzX2lhbV9wb2xpY3kuYWRtaW5pc3RyYXRvci1hY2Nlc3M6IFJlYWRpbmcuLi5cbm1vZHVsZS5paC10Zi1hd3MtY29udHJvbC05OTA0NjY3NDgwNDUtYWRtaW4uZGF0YS5hd3NfaWFtX3BvbGljeS5hZG1pbjogUmVhZGluZy4uLlxubW9kdWxlLmdpdGh1Yi1jb25uZWN0b3IuYXdzX2lhbV9vcGVuaWRfY29ubmVjdF9wcm92aWRlci5naXRodWI6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWFybjphd3M6aWFtOjo5OTA0NjY3NDgwNDU6b2lkYy1wcm92aWRlci90b2tlbi5hY3Rpb25zLmdpdGh1YnVzZXJjb250ZW50LmNvbV1cbmF3c19pYW1fdXNlci5hbGVrczogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YWxla3NdXG5hd3NfaWFtX3JvbGUuaWgtdGYtdGVycmFmb3JtLWNvbnRyb2w6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWloLXRmLXRlcnJhZm9ybS1jb250cm9sXVxuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5hbGxvdy1hc3N1bWU6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTIyMTkxMDY0NTVdXG5tb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtOTkwNDY2NzQ4MDQ1LWFkbWluLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuZ2l0aHViLXBlcm1pc3Npb25zOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0yMDU0ODY2ODkyXVxuYXdzX2lhbV9wb2xpY3kuYWxsb3ctYXNzdW1lOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hcm46YXdzOmlhbTo6OTkwNDY2NzQ4MDQ1OnBvbGljeS9hbGxvdy1hc3N1bWVdXG5tb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtOTkwNDY2NzQ4MDQ1LWFkbWluLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuZ2l0aHViLWFzc3VtZTogUmVhZGluZy4uLlxubW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTk5MDQ2Njc0ODA0NS1hZG1pbi5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmdpdGh1Yi1hc3N1bWU6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTEyNTA0MTY4MTVdXG5tb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtOTkwNDY2NzQ4MDQ1LWFkbWluLmF3c19pYW1fcm9sZS5naXRodWI6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWloLXRmLWF3cy1jb250cm9sLWdpdGh1Yl1cbmF3c19pYW1fYWNjZXNzX2tleS5hbGVrczogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9QUtJQTZOSERMRjJHNjY1VlM1VjJdXG5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmF3cy1hZG1pbjogUmVhZGluZy4uLlxuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5hd3MtYWRtaW46IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTIwOTIxMTI3MzVdXG5hd3NfaWFtX3JvbGUuYXdzLWFkbWluOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hd3MtYWRtaW5dXG5hd3NfaWFtX3VzZXJfcG9saWN5X2F0dGFjaG1lbnQuYWxla3M6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWFsZWtzLTIwMjMwNjMwMDIyMzUyNzgyMDAwMDAwMDAxXVxubW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTk5MDQ2Njc0ODA0NS1hZG1pbi5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmFkbWluLWFzc3VtZTogUmVhZGluZy4uLlxubW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTk5MDQ2Njc0ODA0NS1hZG1pbi5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmFkbWluLWFzc3VtZTogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9NDE4MTM5NDIyOF1cbm1vZHVsZS5paC10Zi1hd3MtY29udHJvbC05OTA0NjY3NDgwNDUtYWRtaW4uYXdzX2lhbV9yb2xlLmFkbWluOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1paC10Zi1hd3MtY29udHJvbC1hZG1pbl1cbmRhdGEuYXdzX2lhbV9wb2xpY3kuYWRtaW5pc3RyYXRvci1hY2Nlc3M6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMnMgW2lkPWFybjphd3M6aWFtOjphd3M6cG9saWN5L0FkbWluaXN0cmF0b3JBY2Nlc3NdXG5hd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnQuaWgtdGYtdGVycmFmb3JtLWNvbnRyb2w6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWloLXRmLXRlcnJhZm9ybS1jb250cm9sLTIwMjMwNjMwMDIzMzE3MTIxMDAwMDAwMDAxXVxuYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50LmF3cy1hZG1pbjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXdzLWFkbWluLTIwMjMwMzIyMDIxMTIxNzk1MDAwMDAwMDAxXVxubW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTk5MDQ2Njc0ODA0NS1hZG1pbi5kYXRhLmF3c19pYW1fcG9saWN5LmFkbWluOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDJzIFtpZD1hcm46YXdzOmlhbTo6YXdzOnBvbGljeS9BZG1pbmlzdHJhdG9yQWNjZXNzXVxubW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTk5MDQ2Njc0ODA0NS1hZG1pbi5hd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnQuYWRtaW46IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWloLXRmLWF3cy1jb250cm9sLWFkbWluLTIwMjMwNzAzMDI0NjA4NDczNDAwMDAwMDAxXVxuXG5UZXJyYWZvcm0gdXNlZCB0aGUgc2VsZWN0ZWQgcHJvdmlkZXJzIHRvIGdlbmVyYXRlIHRoZSBmb2xsb3dpbmcgZXhlY3V0aW9uXG5wbGFuLiBSZXNvdXJjZSBhY3Rpb25zIGFyZSBpbmRpY2F0ZWQgd2l0aCB0aGUgZm9sbG93aW5nIHN5bWJvbHM6XG4gICsgY3JlYXRlXG4gIH4gdXBkYXRlIGluLXBsYWNlXG4gPD0gcmVhZCAoZGF0YSByZXNvdXJjZXMpXG5cblRlcnJhZm9ybSB3aWxsIHBlcmZvcm0gdGhlIGZvbGxvd2luZyBhY3Rpb25zOlxuXG4gICMgbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTk5MDQ2Njc0ODA0NS1hZG1pbi5hd3NfaWFtX3BvbGljeS5naXRodWIgd2lsbCBiZSBjcmVhdGVkXG4gICsgcmVzb3VyY2UgXCJhd3NfaWFtX3BvbGljeVwiIFwiZ2l0aHViXCIge1xuICAgICAgKyBhcm4gICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgaWQgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIG5hbWUgICAgICAgID0gXCJpaC10Zi1hd3MtY29udHJvbC1naXRodWJcIlxuICAgICAgKyBuYW1lX3ByZWZpeCA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgcGF0aCAgICAgICAgPSBcIi9cIlxuICAgICAgKyBwb2xpY3kgICAgICA9IGpzb25lbmNvZGUoXG4gICAgICAgICAgICB7XG4gICAgICAgICAgICAgICsgU3RhdGVtZW50ID0gW1xuICAgICAgICAgICAgICAgICAgKyB7XG4gICAgICAgICAgICAgICAgICAgICAgKyBBY3Rpb24gICA9IFwic3RzOkFzc3VtZVJvbGVcIlxuICAgICAgICAgICAgICAgICAgICAgICsgRWZmZWN0ICAgPSBcIkFsbG93XCJcbiAgICAgICAgICAgICAgICAgICAgICArIFJlc291cmNlID0gXCIqXCJcbiAgICAgICAgICAgICAgICAgICAgfSxcbiAgICAgICAgICAgICAgICAgICsge1xuICAgICAgICAgICAgICAgICAgICAgICsgQWN0aW9uICAgPSBcInMzOipcIlxuICAgICAgICAgICAgICAgICAgICAgICsgRWZmZWN0ICAgPSBcIkFsbG93XCJcbiAgICAgICAgICAgICAgICAgICAgICArIFJlc291cmNlID0gXCJhcm46YXdzOnMzOjo6aW5mcmFob3VzZS1hd3MtY29udHJvbC05OTA0NjY3NDgwNDUvKlwiXG4gICAgICAgICAgICAgICAgICAgIH0sXG4gICAgICAgICAgICAgICAgXVxuICAgICAgICAgICAgICArIFZlcnNpb24gICA9IFwiMjAxMi0xMC0xN1wiXG4gICAgICAgICAgICB9XG4gICAgICAgIClcbiAgICAgICsgcG9saWN5X2lkICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIHRhZ3NfYWxsICAgID0ge1xuICAgICAgICAgICsgXCJjcmVhdGVkX2J5XCIgPSBcImluZnJhaG91c2UvYXdzLWNvbnRyb2wtOTkwNDY2NzQ4MDQ1XCJcbiAgICAgICAgfVxuICAgIH1cblxuICAjIG1vZHVsZS5paC10Zi1hd3MtY29udHJvbC05OTA0NjY3NDgwNDUtYWRtaW4uYXdzX2lhbV9yb2xlLmFkbWluIHdpbGwgYmUgdXBkYXRlZCBpbi1wbGFjZVxuICB+IHJlc291cmNlIFwiYXdzX2lhbV9yb2xlXCIgXCJhZG1pblwiIHtcbiAgICAgIH4gYXNzdW1lX3JvbGVfcG9saWN5ICAgID0ganNvbmVuY29kZShcbiAgICAgICAgICB+IHtcbiAgICAgICAgICAgICAgfiBTdGF0ZW1lbnQgPSBbXG4gICAgICAgICAgICAgICAgICB+IHtcbiAgICAgICAgICAgICAgICAgICAgICB+IFByaW5jaXBhbCA9IHtcbiAgICAgICAgICAgICAgICAgICAgICAgICAgfiBBV1MgPSBbXG4gICAgICAgICAgICAgICAgICAgICAgICAgICAgICAtIFwiYXJuOmF3czppYW06Ojk5MDQ2Njc0ODA0NTp1c2VyL2FsZWtzXCIsXG4gICAgICAgICAgICAgICAgICAgICAgICAgICAgICAtIFwiYXJuOmF3czppYW06Ojk5MDQ2Njc0ODA0NTpyb2xlL2loLXRmLWF3cy1jb250cm9sLWdpdGh1YlwiLFxuICAgICAgICAgICAgICAgICAgICAgICAgICAgIF0gLT4gXCJhcm46YXdzOmlhbTo6OTkwNDY2NzQ4MDQ1OnJvbGUvaWgtdGYtYXdzLWNvbnRyb2wtZ2l0aHViXCJcbiAgICAgICAgICAgICAgICAgICAgICAgIH1cbiAgICAgICAgICAgICAgICAgICAgICAgICMgKDMgdW5jaGFuZ2VkIGF0dHJpYnV0ZXMgaGlkZGVuKVxuICAgICAgICAgICAgICAgICAgICB9LFxuICAgICAgICAgICAgICAgICAgLSB7XG4gICAgICAgICAgICAgICAgICAgICAgLSBBY3Rpb24gICAgPSBcInN0czpBc3N1bWVSb2xlV2l0aFdlYklkZW50aXR5XCJcbiAgICAgICAgICAgICAgICAgICAgICAtIENvbmRpdGlvbiA9IHtcbiAgICAgICAgICAgICAgICAgICAgICAgICAgLSBTdHJpbmdFcXVhbHMgPSB7XG4gICAgICAgICAgICAgICAgICAgICAgICAgICAgICAtIFwidG9rZW4uYWN0aW9ucy5naXRodWJ1c2VyY29udGVudC5jb206YXVkXCIgPSBcInN0cy5hbWF6b25hd3MuY29tXCJcbiAgICAgICAgICAgICAgICAgICAgICAgICAgICB9XG4gICAgICAgICAgICAgICAgICAgICAgICAgIC0gU3RyaW5nTGlrZSAgID0ge1xuICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgLSBcInRva2VuLmFjdGlvbnMuZ2l0aHVidXNlcmNvbnRlbnQuY29tOnN1YlwiID0gXCJyZXBvOmluZnJhaG91c2UvYXdzLWNvbnRyb2w6KlwiXG4gICAgICAgICAgICAgICAgICAgICAgICAgICAgfVxuICAgICAgICAgICAgICAgICAgICAgICAgfVxuICAgICAgICAgICAgICAgICAgICAgIC0gRWZmZWN0ICAgID0gXCJBbGxvd1wiXG4gICAgICAgICAgICAgICAgICAgICAgLSBQcmluY2lwYWwgPSB7XG4gICAgICAgICAgICAgICAgICAgICAgICAgIC0gRmVkZXJhdGVkID0gXCJhcm46YXdzOmlhbTo6OTkwNDY2NzQ4MDQ1Om9pZGMtcHJvdmlkZXIvdG9rZW4uYWN0aW9ucy5naXRodWJ1c2VyY29udGVudC5jb21cIlxuICAgICAgICAgICAgICAgICAgICAgICAgfVxuICAgICAgICAgICAgICAgICAgICAgIC0gU2lkICAgICAgID0gXCIwMTBcIlxuICAgICAgICAgICAgICAgICAgICB9LFxuICAgICAgICAgICAgICAgIF1cbiAgICAgICAgICAgICAgICAjICgxIHVuY2hhbmdlZCBhdHRyaWJ1dGUgaGlkZGVuKVxuICAgICAgICAgICAgfVxuICAgICAgICApXG4gICAgICAgIGlkICAgICAgICAgICAgICAgICAgICA9IFwiaWgtdGYtYXdzLWNvbnRyb2wtYWRtaW5cIlxuICAgICAgICBuYW1lICAgICAgICAgICAgICAgICAgPSBcImloLXRmLWF3cy1jb250cm9sLWFkbWluXCJcbiAgICAgICAgdGFncyAgICAgICAgICAgICAgICAgID0ge31cbiAgICAgICAgIyAoOSB1bmNoYW5nZWQgYXR0cmlidXRlcyBoaWRkZW4pXG4gICAgfVxuXG4gICMgbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTk5MDQ2Njc0ODA0NS1hZG1pbi5hd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnQuZ2l0aHViIHdpbGwgYmUgY3JlYXRlZFxuICArIHJlc291cmNlIFwiYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50XCIgXCJnaXRodWJcIiB7XG4gICAgICArIGlkICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIHBvbGljeV9hcm4gPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIHJvbGUgICAgICAgPSBcImloLXRmLWF3cy1jb250cm9sLWdpdGh1YlwiXG4gICAgfVxuXG4gICMgbW9kdWxlLm1lZGlhcGMuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5iYWNrdXBlci1wZXJtaXNzaW9ucyB3aWxsIGJlIHJlYWQgZHVyaW5nIGFwcGx5XG4gICMgKGNvbmZpZyByZWZlcnMgdG8gdmFsdWVzIG5vdCB5ZXQga25vd24pXG4gPD0gZGF0YSBcImF3c19pYW1fcG9saWN5X2RvY3VtZW50XCIgXCJiYWNrdXBlci1wZXJtaXNzaW9uc1wiIHtcbiAgICAgICsgaWQgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsganNvbiA9IChrbm93biBhZnRlciBhcHBseSlcblxuICAgICAgKyBzdGF0ZW1lbnQge1xuICAgICAgICAgICsgYWN0aW9ucyAgID0gW1xuICAgICAgICAgICAgICArIFwiczM6KlwiLFxuICAgICAgICAgICAgXVxuICAgICAgICAgICsgcmVzb3VyY2VzID0gW1xuICAgICAgICAgICAgICArIChrbm93biBhZnRlciBhcHBseSksXG4gICAgICAgICAgICBdXG4gICAgICAgIH1cbiAgICB9XG5cbiAgIyBtb2R1bGUubWVkaWFwYy5hd3NfaWFtX2FjY2Vzc19rZXkuYmFja3VwZXIgd2lsbCBiZSBjcmVhdGVkXG4gICsgcmVzb3VyY2UgXCJhd3NfaWFtX2FjY2Vzc19rZXlcIiBcImJhY2t1cGVyXCIge1xuICAgICAgKyBjcmVhdGVfZGF0ZSAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIGVuY3J5cHRlZF9zZWNyZXQgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgZW5jcnlwdGVkX3Nlc19zbXRwX3Bhc3N3b3JkX3Y0ID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBpZCAgICAgICAgICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIGtleV9maW5nZXJwcmludCAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgc2VjcmV0ICAgICAgICAgICAgICAgICAgICAgICAgID0gKHNlbnNpdGl2ZSB2YWx1ZSlcbiAgICAgICsgc2VzX3NtdHBfcGFzc3dvcmRfdjQgICAgICAgICAgID0gKHNlbnNpdGl2ZSB2YWx1ZSlcbiAgICAgICsgc3RhdHVzICAgICAgICAgICAgICAgICAgICAgICAgID0gXCJBY3RpdmVcIlxuICAgICAgKyB1c2VyICAgICAgICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgfVxuXG4gICMgbW9kdWxlLm1lZGlhcGMuYXdzX2lhbV9wb2xpY3kuYmFja3VwZXIgd2lsbCBiZSBjcmVhdGVkXG4gICsgcmVzb3VyY2UgXCJhd3NfaWFtX3BvbGljeVwiIFwiYmFja3VwZXJcIiB7XG4gICAgICArIGFybiAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBpZCAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgbmFtZSAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIG5hbWVfcHJlZml4ID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBwYXRoICAgICAgICA9IFwiL1wiXG4gICAgICArIHBvbGljeSAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBwb2xpY3lfaWQgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgdGFnc19hbGwgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgfVxuXG4gICMgbW9kdWxlLm1lZGlhcGMuYXdzX2lhbV91c2VyLmJhY2t1cGVyIHdpbGwgYmUgY3JlYXRlZFxuICArIHJlc291cmNlIFwiYXdzX2lhbV91c2VyXCIgXCJiYWNrdXBlclwiIHtcbiAgICAgICsgYXJuICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgZm9yY2VfZGVzdHJveSA9IGZhbHNlXG4gICAgICArIGlkICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIG5hbWUgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIHBhdGggICAgICAgICAgPSBcIi9cIlxuICAgICAgKyB0YWdzX2FsbCAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyB1bmlxdWVfaWQgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgIH1cblxuICAjIG1vZHVsZS5tZWRpYXBjLmF3c19pYW1fdXNlcl9wb2xpY3lfYXR0YWNobWVudC5iYWNrdXBlciB3aWxsIGJlIGNyZWF0ZWRcbiAgKyByZXNvdXJjZSBcImF3c19pYW1fdXNlcl9wb2xpY3lfYXR0YWNobWVudFwiIFwiYmFja3VwZXJcIiB7XG4gICAgICArIGlkICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIHBvbGljeV9hcm4gPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIHVzZXIgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgfVxuXG4gICMgbW9kdWxlLm1lZGlhcGMuYXdzX3MzX2J1Y2tldC5kc3Qgd2lsbCBiZSBjcmVhdGVkXG4gICsgcmVzb3VyY2UgXCJhd3NfczNfYnVja2V0XCIgXCJkc3RcIiB7XG4gICAgICArIGFjY2VsZXJhdGlvbl9zdGF0dXMgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgYWNsICAgICAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBhcm4gICAgICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIGJ1Y2tldCAgICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgYnVja2V0X2RvbWFpbl9uYW1lICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBidWNrZXRfcHJlZml4ICAgICAgICAgICAgICAgPSBcInR3aW5kYlwiXG4gICAgICArIGJ1Y2tldF9yZWdpb25hbF9kb21haW5fbmFtZSA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgZm9yY2VfZGVzdHJveSAgICAgICAgICAgICAgID0gZmFsc2VcbiAgICAgICsgaG9zdGVkX3pvbmVfaWQgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyBpZCAgICAgICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIG9iamVjdF9sb2NrX2VuYWJsZWQgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgcG9saWN5ICAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyByZWdpb24gICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIHJlcXVlc3RfcGF5ZXIgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgICsgdGFnc19hbGwgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgKyB3ZWJzaXRlX2RvbWFpbiAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIHdlYnNpdGVfZW5kcG9pbnQgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICB9XG5cblBsYW46IDcgdG8gYWRkLCAxIHRvIGNoYW5nZSwgMCB0byBkZXN0cm95LlxuXG5DaGFuZ2VzIHRvIE91dHB1dHM6XG4gICsgbWVkaWFwYy1hY2Nlc3Mta2V5ID0gKHNlbnNpdGl2ZSB2YWx1ZSlcbiAgKyBtZWRpYXBjLWJ1Y2tldCAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICsgbWVkaWFwYy1yZWdpb24gICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICArIG1lZGlhcGMtc2VjcmV0LWtleSA9IChzZW5zaXRpdmUgdmFsdWUpXG5cblx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFxuXG5TYXZlZCB0aGUgcGxhbiB0bzogdGYucGxhblxuXG5UbyBwZXJmb3JtIGV4YWN0bHkgdGhlc2UgYWN0aW9ucywgcnVuIHRoZSBmb2xsb3dpbmcgY29tbWFuZCB0byBhcHBseTpcbiAgICB0ZXJyYWZvcm0gYXBwbHkgXCJ0Zi5wbGFuXCJcbjo6ZGVidWc6OlRlcnJhZm9ybSBleGl0ZWQgd2l0aCBjb2RlIDAuXG46OmRlYnVnOjpzdGRvdXQ6IGRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuaWgtdGYtdGVycmFmb3JtLWNvbnRyb2wtYXNzdW1lOiBSZWFkaW5nLi4uJTBBZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5paC10Zi10ZXJyYWZvcm0tY29udHJvbC1hc3N1bWU6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTEyNjg2NzM4NTJdJTBBZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5hbGxvdy1hc3N1bWU6IFJlYWRpbmcuLi4lMEFtb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtOTkwNDY2NzQ4MDQ1LWFkbWluLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuZ2l0aHViLXBlcm1pc3Npb25zOiBSZWFkaW5nLi4uJTBBZGF0YS5hd3NfaWFtX3BvbGljeS5hZG1pbmlzdHJhdG9yLWFjY2VzczogUmVhZGluZy4uLiUwQW1vZHVsZS5paC10Zi1hd3MtY29udHJvbC05OTA0NjY3NDgwNDUtYWRtaW4uZGF0YS5hd3NfaWFtX3BvbGljeS5hZG1pbjogUmVhZGluZy4uLiUwQW1vZHVsZS5naXRodWItY29ubmVjdG9yLmF3c19pYW1fb3BlbmlkX2Nvbm5lY3RfcHJvdmlkZXIuZ2l0aHViOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hcm46YXdzOmlhbTo6OTkwNDY2NzQ4MDQ1Om9pZGMtcHJvdmlkZXIvdG9rZW4uYWN0aW9ucy5naXRodWJ1c2VyY29udGVudC5jb21dJTBBYXdzX2lhbV91c2VyLmFsZWtzOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hbGVrc10lMEFhd3NfaWFtX3JvbGUuaWgtdGYtdGVycmFmb3JtLWNvbnRyb2w6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWloLXRmLXRlcnJhZm9ybS1jb250cm9sXSUwQWRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuYWxsb3ctYXNzdW1lOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0yMjE5MTA2NDU1XSUwQW1vZHVsZS5paC10Zi1hd3MtY29udHJvbC05OTA0NjY3NDgwNDUtYWRtaW4uZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5naXRodWItcGVybWlzc2lvbnM6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTIwNTQ4NjY4OTJdJTBBYXdzX2lhbV9wb2xpY3kuYWxsb3ctYXNzdW1lOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hcm46YXdzOmlhbTo6OTkwNDY2NzQ4MDQ1OnBvbGljeS9hbGxvdy1hc3N1bWVdJTBBbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTk5MDQ2Njc0ODA0NS1hZG1pbi5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmdpdGh1Yi1hc3N1bWU6IFJlYWRpbmcuLi4lMEFtb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtOTkwNDY2NzQ4MDQ1LWFkbWluLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuZ2l0aHViLWFzc3VtZTogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9MTI1MDQxNjgxNV0lMEFtb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtOTkwNDY2NzQ4MDQ1LWFkbWluLmF3c19pYW1fcm9sZS5naXRodWI6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWloLXRmLWF3cy1jb250cm9sLWdpdGh1Yl0lMEFhd3NfaWFtX2FjY2Vzc19rZXkuYWxla3M6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPUFLSUE2TkhETEYyRzY2NVZTNVYyXSUwQWRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuYXdzLWFkbWluOiBSZWFkaW5nLi4uJTBBZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5hd3MtYWRtaW46IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTIwOTIxMTI3MzVdJTBBYXdzX2lhbV9yb2xlLmF3cy1hZG1pbjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXdzLWFkbWluXSUwQWF3c19pYW1fdXNlcl9wb2xpY3lfYXR0YWNobWVudC5hbGVrczogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YWxla3MtMjAyMzA2MzAwMjIzNTI3ODIwMDAwMDAwMDFdJTBBbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTk5MDQ2Njc0ODA0NS1hZG1pbi5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmFkbWluLWFzc3VtZTogUmVhZGluZy4uLiUwQW1vZHVsZS5paC10Zi1hd3MtY29udHJvbC05OTA0NjY3NDgwNDUtYWRtaW4uZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5hZG1pbi1hc3N1bWU6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTQxODEzOTQyMjhdJTBBbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTk5MDQ2Njc0ODA0NS1hZG1pbi5hd3NfaWFtX3JvbGUuYWRtaW46IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWloLXRmLWF3cy1jb250cm9sLWFkbWluXSUwQWRhdGEuYXdzX2lhbV9wb2xpY3kuYWRtaW5pc3RyYXRvci1hY2Nlc3M6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMnMgW2lkPWFybjphd3M6aWFtOjphd3M6cG9saWN5L0FkbWluaXN0cmF0b3JBY2Nlc3NdJTBBYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50LmloLXRmLXRlcnJhZm9ybS1jb250cm9sOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1paC10Zi10ZXJyYWZvcm0tY29udHJvbC0yMDIzMDYzMDAyMzMxNzEyMTAwMDAwMDAwMV0lMEFhd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnQuYXdzLWFkbWluOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hd3MtYWRtaW4tMjAyMzAzMjIwMjExMjE3OTUwMDAwMDAwMDFdJTBBbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTk5MDQ2Njc0ODA0NS1hZG1pbi5kYXRhLmF3c19pYW1fcG9saWN5LmFkbWluOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDJzIFtpZD1hcm46YXdzOmlhbTo6YXdzOnBvbGljeS9BZG1pbmlzdHJhdG9yQWNjZXNzXSUwQW1vZHVsZS5paC10Zi1hd3MtY29udHJvbC05OTA0NjY3NDgwNDUtYWRtaW4uYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50LmFkbWluOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1paC10Zi1hd3MtY29udHJvbC1hZG1pbi0yMDIzMDcwMzAyNDYwODQ3MzQwMDAwMDAwMV0lMEElMEFUZXJyYWZvcm0gdXNlZCB0aGUgc2VsZWN0ZWQgcHJvdmlkZXJzIHRvIGdlbmVyYXRlIHRoZSBmb2xsb3dpbmcgZXhlY3V0aW9uJTBBcGxhbi4gUmVzb3VyY2UgYWN0aW9ucyBhcmUgaW5kaWNhdGVkIHdpdGggdGhlIGZvbGxvd2luZyBzeW1ib2xzOiUwQSAgKyBjcmVhdGUlMEEgIH4gdXBkYXRlIGluLXBsYWNlJTBBIDw9IHJlYWQgKGRhdGEgcmVzb3VyY2VzKSUwQSUwQVRlcnJhZm9ybSB3aWxsIHBlcmZvcm0gdGhlIGZvbGxvd2luZyBhY3Rpb25zOiUwQSUwQSAgIyBtb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtOTkwNDY2NzQ4MDQ1LWFkbWluLmF3c19pYW1fcG9saWN5LmdpdGh1YiB3aWxsIGJlIGNyZWF0ZWQlMEEgICsgcmVzb3VyY2UgXCJhd3NfaWFtX3BvbGljeVwiIFwiZ2l0aHViXCIgeyUwQSAgICAgICsgYXJuICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBpZCAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIG5hbWUgICAgICAgID0gXCJpaC10Zi1hd3MtY29udHJvbC1naXRodWJcIiUwQSAgICAgICsgbmFtZV9wcmVmaXggPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBwYXRoICAgICAgICA9IFwiL1wiJTBBICAgICAgKyBwb2xpY3kgICAgICA9IGpzb25lbmNvZGUoJTBBICAgICAgICAgICAgeyUwQSAgICAgICAgICAgICAgKyBTdGF0ZW1lbnQgPSBbJTBBICAgICAgICAgICAgICAgICAgKyB7JTBBICAgICAgICAgICAgICAgICAgICAgICsgQWN0aW9uICAgPSBcInN0czpBc3N1bWVSb2xlXCIlMEEgICAgICAgICAgICAgICAgICAgICAgKyBFZmZlY3QgICA9IFwiQWxsb3dcIiUwQSAgICAgICAgICAgICAgICAgICAgICArIFJlc291cmNlID0gXCIqXCIlMEEgICAgICAgICAgICAgICAgICAgIH0sJTBBICAgICAgICAgICAgICAgICAgKyB7JTBBICAgICAgICAgICAgICAgICAgICAgICsgQWN0aW9uICAgPSBcInMzOipcIiUwQSAgICAgICAgICAgICAgICAgICAgICArIEVmZmVjdCAgID0gXCJBbGxvd1wiJTBBICAgICAgICAgICAgICAgICAgICAgICsgUmVzb3VyY2UgPSBcImFybjphd3M6czM6OjppbmZyYWhvdXNlLWF3cy1jb250cm9sLTk5MDQ2Njc0ODA0NS8qXCIlMEEgICAgICAgICAgICAgICAgICAgIH0sJTBBICAgICAgICAgICAgICAgIF0lMEEgICAgICAgICAgICAgICsgVmVyc2lvbiAgID0gXCIyMDEyLTEwLTE3XCIlMEEgICAgICAgICAgICB9JTBBICAgICAgICApJTBBICAgICAgKyBwb2xpY3lfaWQgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIHRhZ3NfYWxsICAgID0geyUwQSAgICAgICAgICArIFwiY3JlYXRlZF9ieVwiID0gXCJpbmZyYWhvdXNlL2F3cy1jb250cm9sLTk5MDQ2Njc0ODA0NVwiJTBBICAgICAgICB9JTBBICAgIH0lMEElMEEgICMgbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTk5MDQ2Njc0ODA0NS1hZG1pbi5hd3NfaWFtX3JvbGUuYWRtaW4gd2lsbCBiZSB1cGRhdGVkIGluLXBsYWNlJTBBICB+IHJlc291cmNlIFwiYXdzX2lhbV9yb2xlXCIgXCJhZG1pblwiIHslMEEgICAgICB+IGFzc3VtZV9yb2xlX3BvbGljeSAgICA9IGpzb25lbmNvZGUoJTBBICAgICAgICAgIH4geyUwQSAgICAgICAgICAgICAgfiBTdGF0ZW1lbnQgPSBbJTBBICAgICAgICAgICAgICAgICAgfiB7JTBBICAgICAgICAgICAgICAgICAgICAgIH4gUHJpbmNpcGFsID0geyUwQSAgICAgICAgICAgICAgICAgICAgICAgICAgfiBBV1MgPSBbJTBBICAgICAgICAgICAgICAgICAgICAgICAgICAgICAgLSBcImFybjphd3M6aWFtOjo5OTA0NjY3NDgwNDU6dXNlci9hbGVrc1wiLCUwQSAgICAgICAgICAgICAgICAgICAgICAgICAgICAgIC0gXCJhcm46YXdzOmlhbTo6OTkwNDY2NzQ4MDQ1OnJvbGUvaWgtdGYtYXdzLWNvbnRyb2wtZ2l0aHViXCIsJTBBICAgICAgICAgICAgICAgICAgICAgICAgICAgIF0gLT4gXCJhcm46YXdzOmlhbTo6OTkwNDY2NzQ4MDQ1OnJvbGUvaWgtdGYtYXdzLWNvbnRyb2wtZ2l0aHViXCIlMEEgICAgICAgICAgICAgICAgICAgICAgICB9JTBBICAgICAgICAgICAgICAgICAgICAgICAgIyAoMyB1bmNoYW5nZWQgYXR0cmlidXRlcyBoaWRkZW4pJTBBICAgICAgICAgICAgICAgICAgICB9LCUwQSAgICAgICAgICAgICAgICAgIC0geyUwQSAgICAgICAgICAgICAgICAgICAgICAtIEFjdGlvbiAgICA9IFwic3RzOkFzc3VtZVJvbGVXaXRoV2ViSWRlbnRpdHlcIiUwQSAgICAgICAgICAgICAgICAgICAgICAtIENvbmRpdGlvbiA9IHslMEEgICAgICAgICAgICAgICAgICAgICAgICAgIC0gU3RyaW5nRXF1YWxzID0geyUwQSAgICAgICAgICAgICAgICAgICAgICAgICAgICAgIC0gXCJ0b2tlbi5hY3Rpb25zLmdpdGh1YnVzZXJjb250ZW50LmNvbTphdWRcIiA9IFwic3RzLmFtYXpvbmF3cy5jb21cIiUwQSAgICAgICAgICAgICAgICAgICAgICAgICAgICB9JTBBICAgICAgICAgICAgICAgICAgICAgICAgICAtIFN0cmluZ0xpa2UgICA9IHslMEEgICAgICAgICAgICAgICAgICAgICAgICAgICAgICAtIFwidG9rZW4uYWN0aW9ucy5naXRodWJ1c2VyY29udGVudC5jb206c3ViXCIgPSBcInJlcG86aW5mcmFob3VzZS9hd3MtY29udHJvbDoqXCIlMEEgICAgICAgICAgICAgICAgICAgICAgICAgICAgfSUwQSAgICAgICAgICAgICAgICAgICAgICAgIH0lMEEgICAgICAgICAgICAgICAgICAgICAgLSBFZmZlY3QgICAgPSBcIkFsbG93XCIlMEEgICAgICAgICAgICAgICAgICAgICAgLSBQcmluY2lwYWwgPSB7JTBBICAgICAgICAgICAgICAgICAgICAgICAgICAtIEZlZGVyYXRlZCA9IFwiYXJuOmF3czppYW06Ojk5MDQ2Njc0ODA0NTpvaWRjLXByb3ZpZGVyL3Rva2VuLmFjdGlvbnMuZ2l0aHVidXNlcmNvbnRlbnQuY29tXCIlMEEgICAgICAgICAgICAgICAgICAgICAgICB9JTBBICAgICAgICAgICAgICAgICAgICAgIC0gU2lkICAgICAgID0gXCIwMTBcIiUwQSAgICAgICAgICAgICAgICAgICAgfSwlMEEgICAgICAgICAgICAgICAgXSUwQSAgICAgICAgICAgICAgICAjICgxIHVuY2hhbmdlZCBhdHRyaWJ1dGUgaGlkZGVuKSUwQSAgICAgICAgICAgIH0lMEEgICAgICAgICklMEEgICAgICAgIGlkICAgICAgICAgICAgICAgICAgICA9IFwiaWgtdGYtYXdzLWNvbnRyb2wtYWRtaW5cIiUwQSAgICAgICAgbmFtZSAgICAgICAgICAgICAgICAgID0gXCJpaC10Zi1hd3MtY29udHJvbC1hZG1pblwiJTBBICAgICAgICB0YWdzICAgICAgICAgICAgICAgICAgPSB7fSUwQSAgICAgICAgIyAoOSB1bmNoYW5nZWQgYXR0cmlidXRlcyBoaWRkZW4pJTBBICAgIH0lMEElMEEgICMgbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTk5MDQ2Njc0ODA0NS1hZG1pbi5hd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnQuZ2l0aHViIHdpbGwgYmUgY3JlYXRlZCUwQSAgKyByZXNvdXJjZSBcImF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudFwiIFwiZ2l0aHViXCIgeyUwQSAgICAgICsgaWQgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIHBvbGljeV9hcm4gPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyByb2xlICAgICAgID0gXCJpaC10Zi1hd3MtY29udHJvbC1naXRodWJcIiUwQSAgICB9JTBBJTBBICAjIG1vZHVsZS5tZWRpYXBjLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuYmFja3VwZXItcGVybWlzc2lvbnMgd2lsbCBiZSByZWFkIGR1cmluZyBhcHBseSUwQSAgIyAoY29uZmlnIHJlZmVycyB0byB2YWx1ZXMgbm90IHlldCBrbm93biklMEEgPD0gZGF0YSBcImF3c19pYW1fcG9saWN5X2RvY3VtZW50XCIgXCJiYWNrdXBlci1wZXJtaXNzaW9uc1wiIHslMEEgICAgICArIGlkICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBqc29uID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSUwQSAgICAgICsgc3RhdGVtZW50IHslMEEgICAgICAgICAgKyBhY3Rpb25zICAgPSBbJTBBICAgICAgICAgICAgICArIFwiczM6KlwiLCUwQSAgICAgICAgICAgIF0lMEEgICAgICAgICAgKyByZXNvdXJjZXMgPSBbJTBBICAgICAgICAgICAgICArIChrbm93biBhZnRlciBhcHBseSksJTBBICAgICAgICAgICAgXSUwQSAgICAgICAgfSUwQSAgICB9JTBBJTBBICAjIG1vZHVsZS5tZWRpYXBjLmF3c19pYW1fYWNjZXNzX2tleS5iYWNrdXBlciB3aWxsIGJlIGNyZWF0ZWQlMEEgICsgcmVzb3VyY2UgXCJhd3NfaWFtX2FjY2Vzc19rZXlcIiBcImJhY2t1cGVyXCIgeyUwQSAgICAgICsgY3JlYXRlX2RhdGUgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgZW5jcnlwdGVkX3NlY3JldCAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgZW5jcnlwdGVkX3Nlc19zbXRwX3Bhc3N3b3JkX3Y0ID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgaWQgICAgICAgICAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsga2V5X2ZpbmdlcnByaW50ICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgc2VjcmV0ICAgICAgICAgICAgICAgICAgICAgICAgID0gKHNlbnNpdGl2ZSB2YWx1ZSklMEEgICAgICArIHNlc19zbXRwX3Bhc3N3b3JkX3Y0ICAgICAgICAgICA9IChzZW5zaXRpdmUgdmFsdWUpJTBBICAgICAgKyBzdGF0dXMgICAgICAgICAgICAgICAgICAgICAgICAgPSBcIkFjdGl2ZVwiJTBBICAgICAgKyB1c2VyICAgICAgICAgICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgIH0lMEElMEEgICMgbW9kdWxlLm1lZGlhcGMuYXdzX2lhbV9wb2xpY3kuYmFja3VwZXIgd2lsbCBiZSBjcmVhdGVkJTBBICArIHJlc291cmNlIFwiYXdzX2lhbV9wb2xpY3lcIiBcImJhY2t1cGVyXCIgeyUwQSAgICAgICsgYXJuICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBpZCAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIG5hbWUgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgbmFtZV9wcmVmaXggPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBwYXRoICAgICAgICA9IFwiL1wiJTBBICAgICAgKyBwb2xpY3kgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIHBvbGljeV9pZCAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgdGFnc19hbGwgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgIH0lMEElMEEgICMgbW9kdWxlLm1lZGlhcGMuYXdzX2lhbV91c2VyLmJhY2t1cGVyIHdpbGwgYmUgY3JlYXRlZCUwQSAgKyByZXNvdXJjZSBcImF3c19pYW1fdXNlclwiIFwiYmFja3VwZXJcIiB7JTBBICAgICAgKyBhcm4gICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgZm9yY2VfZGVzdHJveSA9IGZhbHNlJTBBICAgICAgKyBpZCAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgbmFtZSAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIHBhdGggICAgICAgICAgPSBcIi9cIiUwQSAgICAgICsgdGFnc19hbGwgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIHVuaXF1ZV9pZCAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgIH0lMEElMEEgICMgbW9kdWxlLm1lZGlhcGMuYXdzX2lhbV91c2VyX3BvbGljeV9hdHRhY2htZW50LmJhY2t1cGVyIHdpbGwgYmUgY3JlYXRlZCUwQSAgKyByZXNvdXJjZSBcImF3c19pYW1fdXNlcl9wb2xpY3lfYXR0YWNobWVudFwiIFwiYmFja3VwZXJcIiB7JTBBICAgICAgKyBpZCAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgcG9saWN5X2FybiA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIHVzZXIgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgIH0lMEElMEEgICMgbW9kdWxlLm1lZGlhcGMuYXdzX3MzX2J1Y2tldC5kc3Qgd2lsbCBiZSBjcmVhdGVkJTBBICArIHJlc291cmNlIFwiYXdzX3MzX2J1Y2tldFwiIFwiZHN0XCIgeyUwQSAgICAgICsgYWNjZWxlcmF0aW9uX3N0YXR1cyAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgYWNsICAgICAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgYXJuICAgICAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgYnVja2V0ICAgICAgICAgICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgYnVja2V0X2RvbWFpbl9uYW1lICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgYnVja2V0X3ByZWZpeCAgICAgICAgICAgICAgID0gXCJ0d2luZGJcIiUwQSAgICAgICsgYnVja2V0X3JlZ2lvbmFsX2RvbWFpbl9uYW1lID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgZm9yY2VfZGVzdHJveSAgICAgICAgICAgICAgID0gZmFsc2UlMEEgICAgICArIGhvc3RlZF96b25lX2lkICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIGlkICAgICAgICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIG9iamVjdF9sb2NrX2VuYWJsZWQgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIHBvbGljeSAgICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIHJlZ2lvbiAgICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIHJlcXVlc3RfcGF5ZXIgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIHRhZ3NfYWxsICAgICAgICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIHdlYnNpdGVfZG9tYWluICAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIHdlYnNpdGVfZW5kcG9pbnQgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgfSUwQSUwQVBsYW46IDcgdG8gYWRkLCAxIHRvIGNoYW5nZSwgMCB0byBkZXN0cm95LiUwQSUwQUNoYW5nZXMgdG8gT3V0cHV0czolMEEgICsgbWVkaWFwYy1hY2Nlc3Mta2V5ID0gKHNlbnNpdGl2ZSB2YWx1ZSklMEEgICsgbWVkaWFwYy1idWNrZXQgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgKyBtZWRpYXBjLXJlZ2lvbiAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICArIG1lZGlhcGMtc2VjcmV0LWtleSA9IChzZW5zaXRpdmUgdmFsdWUpJTBBJTBBXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwJTBBJTBBU2F2ZWQgdGhlIHBsYW4gdG86IHRmLnBsYW4lMEElMEFUbyBwZXJmb3JtIGV4YWN0bHkgdGhlc2UgYWN0aW9ucywgcnVuIHRoZSBmb2xsb3dpbmcgY29tbWFuZCB0byBhcHBseTolMEEgICAgdGVycmFmb3JtIGFwcGx5IFwidGYucGxhblwiJTBBXG46OmRlYnVnOjpzdGRlcnI6IFxuOjpkZWJ1Zzo6ZXhpdGNvZGU6IDBcbiIsICJzdGRlcnIiOiAiIiwgImFkZCI6IDcsICJjaGFuZ2UiOiAxLCAiZGVzdHJveSI6IDB9fQ==```
</p></details>